src/InformationRegisters/КлючиВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлючиВнешнихСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодтверждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлючейВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодДействителенДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<Comment>Предварительная запись клиента</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминанияДоЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренесённаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолисМедСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаРезерва</Name>
					<Comment>Цвет фона резерва</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЗаблокированно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗаписи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗаписи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/HTTPServices/MobileApp/Ext/Module.bsl
#Область ОбработчикиСобытий

// Функция, является основной точкой входа методов GET.
// 
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция v1GET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка	                                                         
		
		Метод 			   = НРег(Запрос.ПараметрыURL["metod"]);
		ПараметрыЗапроса   = Запрос.ПараметрыЗапроса;
		ЗаголовкиЗапроса   = MobileApp_v1.ПривестиЗаголовкиВНижнийРегистр(Запрос);
		
		Если Метод = НРег("test_connect") Тогда			
			КодПроверки = ЛичныйКабинет.ПолучитьКодПроверкиРубликации();
			Возврат MobileApp_v1.ПолучитьHTTPОтвет(Новый Структура("Result, CheckCode", Истина, КодПроверки));
		КонецЕсли;
		
		ApiKey = ЗаголовкиЗапроса.Получить("apikey");
		Если Не ЗначениеЗаполнено(ApiKey) Тогда			
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2001);
		КонецЕсли;                                                      
		
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey,,Истина);
		Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2002);		
		КонецЕсли;
		
		UserToken = ЗаголовкиЗапроса.Получить("usertoken");
		Если Не ЗначениеЗаполнено(UserToken) Тогда			
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2003);
		КонецЕсли;
		
		Сотрудник = РегистрыСведений.КлючиВнешнихСистем.ПолучитьКлиентаПоКлючу(UserToken);
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2003);		
		КонецЕсли;
		
		Если Метод <> НРег("get_date_server") 
			И Метод <> НРег("version_software") 
			И Метод <> НРег("clubs") 
			И Метод <> НРег("get_appointment_data") 
			И Метод <> НРег("get_user_role") Тогда
			
			StructuralUnit = ЗаголовкиЗапроса.Получить("structuralunit");
			Если StructuralUnit = Неопределено Тогда			
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2000);
			КонецЕсли;
			
			УидСЕ = Новый УникальныйИдентификатор(StructuralUnit);
			СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(УидСЕ);
			
			Если СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка() Тогда
				СтруктурнаяЕдиница = Неопределено;
				СписокМестРаботыСотрудника = MobileApp_v1.ПолучитьМестаРаботыСотрудника(Сотрудник);
				Для Каждого Элемент Из СписокМестРаботыСотрудника Цикл
					СтруктурнаяЕдиница = Элемент;
					Прервать;
				КонецЦикла;		
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2000);		
			КонецЕсли;
			
		КонецЕсли;
		
		ДатаНачала 	  = MobileApp_v1.ПолучитьДату(ЗаголовкиЗапроса.Получить("startdate"));
		ДатаРасчета	  = MobileApp_v1.ПолучитьДату(ЗаголовкиЗапроса.Получить("currentdate"));
		ДатаОкончания = MobileApp_v1.ПолучитьДату(ЗаголовкиЗапроса.Получить("enddate"));
		
		Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
			ДатаОкончания = MobileApp_v1.ПолучитьДату(ЗаголовкиЗапроса.Получить("expirationdate"));
		КонецЕсли;
		
		Если Метод = НРег("version_software") Тогда
			
			Ответ1с = MobileApp_v1.get_version_software();
			
		ИначеЕсли Метод = НРег("get_schedule_structural") Тогда
			
			Ответ1с = MobileApp_v1.get_schedule_structural(СтруктурнаяЕдиница);
			
		ИначеЕсли Метод = НРег("get_date_server") Тогда
			
			Ответ1с = MobileApp_v1.get_date_server();
			
		ИначеЕсли Метод = НРег("get_doctors") Тогда	
			
			Если Не ЗначениеЗаполнено(ДатаНачала) ИЛИ Не ЗначениеЗаполнено(ДатаОкончания) Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2019);		
			КонецЕсли;
			
			Ответ1с = MobileApp_v1.get_doctors(Сотрудник, СтруктурнаяЕдиница, ДатаНачала, ДатаОкончания);
						
		ИначеЕсли Метод = НРег("get_rooms") Тогда	 
			
			Если Не ЗначениеЗаполнено(ДатаНачала) ИЛИ Не ЗначениеЗаполнено(ДатаОкончания) Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2019);		
			КонецЕсли;
			
			Ответ1с = MobileApp_v1.get_rooms(СтруктурнаяЕдиница, ДатаНачала, ДатаОкончания);
			
		ИначеЕсли Метод = НРег("get_settings_visit") Тогда
			
			Ответ1с = MobileApp_v1.get_settings_visit(СтруктурнаяЕдиница, Сотрудник);

		ИначеЕсли Метод = НРег("find_client_by_line") Тогда
			
			СтрокаПоиска = ЗаголовкиЗапроса.Получить("searchline");
			Если СтрокаПоиска = Неопределено Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2023);	
			КонецЕсли;
			
			Ответ1с = MobileApp_v1.find_client_by_line(СтрокаПоиска, Сотрудник);
												
		ИначеЕсли Метод = НРег("get_appointment_data") Тогда
			
			УидСобытия  = ЗаголовкиЗапроса.Получить("visit");
			Событие = ?(ЗначениеЗаполнено(УидСобытия), Документы.Событие.ПолучитьСсылку(Новый УникальныйИдентификатор(УидСобытия)), Неопределено);			
			Если Не ЗначениеЗаполнено(Событие) Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2037);		
			КонецЕсли;
			
			Ответ1с = MobileApp_v1.get_appointment_data(Событие, Сотрудник);  													
			
		ИначеЕсли Метод = НРег("get_user_role") Тогда  
			
			Ответ1с = MobileApp_v1.get_user_role(Сотрудник);
			
		ИначеЕсли Метод = НРег("find_insurance_by_client") Тогда  
			
			УидКлиента  = ЗаголовкиЗапроса.Получить("client");
			ОтборКлиент = ?(ЗначениеЗаполнено(УидКлиента), Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(УидКлиента)), Неопределено);
			
			Если Не ЗначениеЗаполнено(ОтборКлиент) Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2048);		
			КонецЕсли;
			
			Ответ1с = MobileApp_v1.find_insurance_by_client(ОтборКлиент);																		
			
		ИначеЕсли Метод = НРег("list_reasons_canceling") Тогда			
			
			Ответ1с = MobileApp_v1.list_reasons_canceling();
									
		ИначеЕсли Метод = НРег("list_appointment") Тогда			
			
			УидКлиента  = ЗаголовкиЗапроса.Получить("client");
			ОтборКлиент = ?(ЗначениеЗаполнено(УидКлиента), Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(УидКлиента)), Неопределено);
			
			Если Не ЗначениеЗаполнено(ОтборКлиент) Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2048);		
			КонецЕсли;
			
			Ответ1с = MobileApp_v1.list_appointment(ОтборКлиент, СтруктурнаяЕдиница, Сотрудник);	
			
		ИначеЕсли Метод = НРег("employee_working_days") Тогда			
			
			Ответ1с = MobileApp_v1.employee_working_days(СтруктурнаяЕдиница, Сотрудник, ДатаНачала, ДатаОкончания);
			
		ИначеЕсли Метод = НРег("reason_appointment") Тогда			
			
			Ответ1с = MobileApp_v1.reason_appointment(СтруктурнаяЕдиница, Сотрудник);			
			
		ИначеЕсли Метод = НРег("get_lables") Тогда			
			
			УидСобытия  = ПараметрыЗапроса.Получить("visit");
			Событие = ?(ЗначениеЗаполнено(УидСобытия), Документы.Событие.ПолучитьСсылку(Новый УникальныйИдентификатор(УидСобытия)), Неопределено);
			
			Ответ1с = MobileApp_v1.get_lables(Событие);
			
		ИначеЕсли Метод = НРег("get_appointment_prescription") Тогда			
			
			УидПриема  = ПараметрыЗапроса.Получить("visit");
			Прием = ?(ЗначениеЗаполнено(УидПриема), Документы.Прием.ПолучитьСсылку(Новый УникальныйИдентификатор(УидПриема)), Неопределено);
			
			Если Не ЗначениеЗаполнено(Прием) Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2037);		
			КонецЕсли;		
			
			Ответ1с = MobileApp_v1.get_appointment_prescription(Прием);
			
		ИначеЕсли Метод = НРег("doctor_schedule") Тогда
			
			// Режим: "РасписаниеКлиникВрачейПриемов" - получаем график СЕ, Врачей и Приемов, 
			//        "РасписаниеВрачейПриемов" - получаем график Врачей и Приемов, 
			//		  "РасписаниеПриемов" - получем только приемы
			
			ДатаНачала 	  		= MobileApp_v1.ПолучитьДату(ПараметрыЗапроса.Получить("start_date"));
			ДатаОкончания		= MobileApp_v1.ПолучитьДату(ПараметрыЗапроса.Получить("end_date"));
			МассивИдСотрудников	= MobileApp_v1.ПолучитьПараметрИзСтрокиJSON(ПараметрыЗапроса, "doctor_ids");
			МассивИдПомещений 	= MobileApp_v1.ПолучитьПараметрИзСтрокиJSON(ПараметрыЗапроса, "room_ids");
			Режим				= ПараметрыЗапроса.Получить("mode");   
						
			Если Не ЗначениеЗаполнено(ДатаНачала) ИЛИ Не ЗначениеЗаполнено(ДатаОкончания) Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2019);		
			КонецЕсли;
						
			Ответ1с = MobileApp_v1.doctor_schedule(Сотрудник, СтруктурнаяЕдиница, ДатаНачала, ДатаОкончания, МассивИдСотрудников, МассивИдПомещений, Режим);			
			
		Иначе                  
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2004);
		КонецЕсли;
		
		Возврат MobileApp_v1.ПолучитьHTTPОтвет(Ответ1с);	
		
	Исключение    
		
		СистемнаяОшибка = ОписаниеОшибки();	
		ЗаписьЖурналаРегистрации("Http-сервисы.MobileApp." + Метод, УровеньЖурналаРегистрации.Ошибка, , , СистемнаяОшибка);
		
		Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 1041, СистемнаяОшибка);
		
	КонецПопытки;
	
КонецФункции

// Функция, является основной точкой входа методов POST.
// 
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция v1POST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Попытка	
		Метод 			   = НРег(Запрос.ПараметрыURL["metod"]);
		ПараметрыЗапроса   = Запрос.ПараметрыЗапроса;
		ЗаголовкиЗапроса   = MobileApp_v1.ПривестиЗаголовкиВНижнийРегистр(Запрос);
		
		ApiKey = ЗаголовкиЗапроса.Получить("apikey");
		Если Не ЗначениеЗаполнено(ApiKey) Тогда			
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2001);
		КонецЕсли;                                                      
		
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey,, Истина);
		Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2002);		
		КонецЕсли;
		
		Если Метод <> НРег("auth") Тогда			
			UserToken = ЗаголовкиЗапроса.Получить("usertoken");
			Если Не ЗначениеЗаполнено(UserToken) Тогда			
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2003);
			КонецЕсли;
			
			Сотрудник = РегистрыСведений.КлючиВнешнихСистем.ПолучитьКлиентаПоКлючу(UserToken);
			Если Не ЗначениеЗаполнено(Сотрудник) Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2003);		
			КонецЕсли;			
		КонецЕсли;
		
		Если Метод <> НРег("get_date_server") И Метод <> НРег("auth") Тогда
			
			StructuralUnit = ЗаголовкиЗапроса.Получить("structuralunit");
			Если StructuralUnit = Неопределено Тогда			
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2000);
			КонецЕсли;
			
			УидСЕ = Новый УникальныйИдентификатор(StructuralUnit);
			СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(УидСЕ);
			
			Если СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка() Тогда
				СтруктурнаяЕдиница = Неопределено;
				СписокМестРаботыСотрудника = MobileApp_v1.ПолучитьМестаРаботыСотрудника(Сотрудник);
				Для Каждого Элемент Из СписокМестРаботыСотрудника Цикл
					СтруктурнаяЕдиница = Элемент;
					Прервать;
				КонецЦикла;		
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2000);		
			КонецЕсли;
			
		КонецЕсли;
		
		ИменаСвойствСоЗначениямиДата = Новый Массив();
		ИменаСвойствСоЗначениямиДата.Добавить("Дата");
		ИменаСвойствСоЗначениямиДата.Добавить("ДатаВремяНачала");
		ИменаСвойствСоЗначениямиДата.Добавить("ДатаВремяОкончания");
		ИменаСвойствСоЗначениямиДата.Добавить("ДатаНачала");
		ИменаСвойствСоЗначениямиДата.Добавить("ДатаОкончания");
		
		ПараметрыJSON = ?(Метод = НРег("auth"), Неопределено, ДекодироватьИзJSON(Запрос.ПолучитьТелоКакСтроку(), ИменаСвойствСоЗначениямиДата));
		ДатаНачала 	  = MobileApp_v1.ПолучитьДату(ЗаголовкиЗапроса.Получить("startdate"));
		ДатаОкончания = MobileApp_v1.ПолучитьДату(ЗаголовкиЗапроса.Получить("enddate"));
		
		Если Метод = НРег("auth") Тогда
			
			Телефон 		 = ЗаголовкиЗапроса.Получить("phone");
			КодПодтверждения = ЗаголовкиЗапроса.Получить("code");
			ТипАвторизации	 = ЗаголовкиЗапроса.Получить("authtype");
			ЭлПочта	 		 = ЗаголовкиЗапроса.Получить("email");
			
 			Ответ1с = MobileApp_v1.PostAuth(ВнешняяСистема, Телефон, КодПодтверждения, ТипАвторизации, ЭлПочта);
								
		ИначеЕсли Метод = НРег("appointment") Тогда
			
			Ответ1с = MobileApp_v1.appointment(ПараметрыJSON, СтруктурнаяЕдиница, Сотрудник, ВнешняяСистема);
			
		ИначеЕсли Метод = НРег("find_client_by_line") Тогда
			
			CтрокаПоиска = ?(ПараметрыJSON.Свойство("search_line"), ПараметрыJSON.search_line , Неопределено);
			Если CтрокаПоиска = Неопределено Тогда
				Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2039);	
			КонецЕсли;
			
			Ответ1с = MobileApp_v1.find_client_by_line(CтрокаПоиска, Сотрудник);		  			
								
		ИначеЕсли Метод = НРег("sync_appointment") Тогда  
			
			Ответ1с = MobileApp_v1.sync_appointment(ПараметрыJSON, СтруктурнаяЕдиница, Сотрудник);
						
		Иначе                  
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2004);
		КонецЕсли;
		
		Возврат MobileApp_v1.ПолучитьHTTPОтвет(Ответ1с);	
		
	Исключение
		
		СистемнаяОшибка = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Http-сервисы.MobileApp." + Метод, УровеньЖурналаРегистрации.Ошибка, , , СистемнаяОшибка);
		
		Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 1041, СистемнаяОшибка);
		
	КонецПопытки;
	
КонецФункции

// Функция, является основной точкой входа методов DELETE.
// 
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция v1DELETE(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Попытка	
		Метод 			   = НРег(Запрос.ПараметрыURL["metod"]);
		ПараметрыЗапроса   = Запрос.ПараметрыЗапроса;
		ЗаголовкиЗапроса   = MobileApp_v1.ПривестиЗаголовкиВНижнийРегистр(Запрос);
		
		ApiKey = ЗаголовкиЗапроса.Получить("apikey");
		Если Не ЗначениеЗаполнено(ApiKey) Тогда			
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2001);
		КонецЕсли;                                                      
		
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey,, Истина);
		Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2002);		
		КонецЕсли;
		
		UserToken = ЗаголовкиЗапроса.Получить("usertoken");
		Если Не ЗначениеЗаполнено(UserToken) Тогда			
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2003);
		КонецЕсли;
		
		Сотрудник = РегистрыСведений.КлючиВнешнихСистем.ПолучитьКлиентаПоКлючу(UserToken);
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2003);		
		КонецЕсли;			
		
		УидСЕ = Новый УникальныйИдентификатор(ЗаголовкиЗапроса.Получить("structuralunit"));
		
		СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(УидСЕ);
		
		Если СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка() Тогда
			СтруктурнаяЕдиница = Новый Массив;
			Для Каждого Строка Из Сотрудник.МестаРаботы Цикл
				СтруктурнаяЕдиница.Добавить(Строка.СтруктурнаяЕдиница);
			КонецЦикла;		
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2000);		
		КонецЕсли;
		
		//Если Метод = НРег("cancel_record") Тогда					
		//	Ответ1с = MobileApp_v1.cancel_record(Прием);		
		//Иначе                  
		//	Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 2004);
		//КонецЕсли;
		
		Возврат MobileApp_v1.ПолучитьHTTPОтвет(MobileApp_v1.ПолучитьСтруктуруОтвета(Новый Структура()));	
		
	Исключение
		
		СистемнаяОшибка = ОписаниеОшибки();		
		ЗаписьЖурналаРегистрации("Http-сервисы.MobileApp." + Метод, УровеньЖурналаРегистрации.Ошибка, , , СистемнаяОшибка);
		
		Возврат MobileApp_v1.ПолучитьСтруктуруОтвета(, 1041, СистемнаяОшибка);
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти
